#+TITLE: Titanic

#+begin_src jupyter-python :session kaggle :async yes
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('../input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))
# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All"
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session
#+end_src

#+RESULTS:
: ../input/titanic/test.csv
: ../input/titanic/train.csv
: ../input/titanic/gender_submission.csv

#+begin_src jupyter-python :session kaggle :async yes :results silent
  def transform2org(df):
      return [list(df)] + [None] + df.values.tolist()
#+end_src
:META:
From https://emacs.stackexchange.com/a/31823/34380
:END:

#+begin_src jupyter-python :session kaggle :async yes
train_data = pd.read_csv("../input/titanic/train.csv")
transform2org(train_data.head())
#+end_src

#+RESULTS:
| PassengerId | Survived | Pclass | Name                                                | Sex    |  Age | SibSp | Parch | Ticket           |    Fare | Cabin | Embarked |
|-------------+----------+--------+-----------------------------------------------------+--------+------+-------+-------+------------------+---------+-------+----------|
|           1 |        0 |      3 | Braund, Mr. Owen Harris                             | male   | 22.0 |     1 |     0 | A/5 21171        |    7.25 |   nan | S        |
|           2 |        1 |      1 | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38.0 |     1 |     0 | PC 17599         | 71.2833 |   C85 | C        |
|           3 |        1 |      3 | Heikkinen, Miss. Laina                              | female | 26.0 |     0 |     0 | STON/O2. 3101282 |   7.925 |   nan | S        |
|           4 |        1 |      1 | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35.0 |     1 |     0 | 113803           |    53.1 |  C123 | S        |
|           5 |        0 |      3 | Allen, Mr. William Henry                            | male   | 35.0 |     0 |     0 | 373450           |    8.05 |   nan | S        |
